In [2]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [24]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df.head()
#np.nan -> For that specific location, it will create nan value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [25]:
#when we provide space seperated value followed by split using dot then it is returning a list.
'CA NV AZ'.split()

['CA', 'NV', 'AZ']

In [26]:
#This df['States'] creating a new column with States and value will assign into that particular column.
df['States']='CA NV AZ'.split()
df.head()

     A    B  C States
0  1.0  5.0  1     CA
1  2.0  NaN  2     NV
2  NaN  NaN  3     AZ

In [27]:
#Set Index by default we are talking about row index.
# The entire state column move to the Index column and it will be added overthere.
df.set_index('States',inplace=True)
#what I did changes in df,If I want to apply permanantely then use (inplace = True), without creating any variable
#print(df)
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [28]:
df.isnull()

            A      B      C
States
CA      False  False  False
NV      False   True  False
AZ       True   True  False

In [29]:
#isnull give null value and sum give you count of null on particular column.
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [9]:
#If there is nan value then how to drop those value?
#Or we can also replace it but we will see later.
df.dropna(axis=0,how='any')
#axis=0 (row wise), it means wherever the nan value is present then it is going to delete the row permanently, if I put how values as 'any' 
#Eventhough, you have one nan value in a row and you put how = 'any' then it is going drop that particular row. 

#df.dropna(axis=0,how='all')
#how='all' basically says that if the entire row is having nan value then it is going to delete it.
#how='any', means if you have atleast one nan value in that record, it is going to delete it.

#df.dropna(axis=1,how='any')
#Instead of row-wise, it will delete column-wise

          A    B  C
States
CA      1.0  5.0  1

In [34]:
#thresh=1 means there is one not-NaN values in row-wise.
#It means atleast 1 Not NaN values is present, so it is not going to remove any row.
#df.dropna(axis=0,how='any',thresh=1)

#thresh=2 means there should be two not-NaN values in row-wise.
#It means atleast 2 Not NaN values is present, so it is not going to remove any row.
df.dropna(axis=0,how='any',thresh=2)
#df.dropna(axis=0,how='any',thresh=3)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [35]:
print("\nDropping a row with a minimum 2 NaN value using 'thresh' parameter")
df.dropna(axis=0,how='any',thresh=4)

Dropping a row with a minimum 2 NaN value using 'thresh' parameter

Empty DataFrame
Columns: [A, B, C]
Index: []

In [11]:
df.fillna(axis=0,method='ffill')

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  5.0  2
AZ      2.0  5.0  3

In [12]:
df.fillna(axis=0,method='bfill')

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [16]:
df['A']

States
CA    1.0
NV    2.0
AZ    NaN
Name: A, dtype: float64

In [20]:
df['A'].mean()

1.5

In [14]:
df['A'].fillna(value='Fill Value')

States
CA             1
NV             2
AZ    Fill Value
Name: A, dtype: object

In [15]:
df['A'].fillna(value=df['A'].mean())

States
CA    1.0
NV    2.0
AZ    1.5
Name: A, dtype: float64

In [17]:
df['A']=df['A'].fillna(value=df['A'].mean())
df['A']

States
CA    1.0
NV    2.0
AZ    1.5
Name: A, dtype: float64

In [18]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [44]:
for i in df.columns:
    df[i]=df[i].fillna(value=df[i].mean())
    #df[i]=df[i].fillna(value=df[i].mode()) #for string, we are using mode

In [45]:
df.head()

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  5.0  2
AZ      1.5  5.0  3

In [52]:
#Create Dataframe
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
'Person' : ['Sam','Charlie','Any','Vanessa','Carl','Sarah'],
'Sales' :[200,300,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    300
2    MSFT      Any    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [63]:
#df.groupby('Company').max()
df.groupby(['Company','Person']).max()

                 Sales
Company Person
FB      Carl       243
        Sarah      350
GOOG    Charlie    300
        Sam        200
MSFT    Any        340
        Vanessa    124

In [71]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  250.0   70.710678  200.0  225.00  250.0  275.00  300.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [72]:
df.groupby('Company').describe().loc['GOOG']

Sales  count      2.000000
       mean     250.000000
       std       70.710678
       min      200.000000
       25%      225.000000
       50%      250.000000
       75%      275.000000
       max      300.000000
Name: GOOG, dtype: float64

In [73]:
pd.DataFrame(df.groupby('Company').describe().loc['GOOG']).transpose()

     Sales
     count   mean        std    min    25%    50%    75%    max
GOOG   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0

In [75]:
pd.DataFrame(df.groupby('Company').describe().loc[['GOOG','FB']]).transpose()

Company            GOOG          FB
Sales count    2.000000    2.000000
      mean   250.000000  296.500000
      std     70.710678   75.660426
      min    200.000000  243.000000
      25%    225.000000  269.750000
      50%    250.000000  296.500000
      75%    275.000000  323.250000
      max    300.000000  350.000000

In [82]:
#Merging two data frames
# Creating data frames
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B' : ['B0','B1','B2','B3'],
                 'C' : ['C0','C1','C2','C3'],
                 'D' : ['D0','D1','D2','D3']},
                index=[0,1,2,3])

In [83]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [85]:
#df1[0] => If I'll provide like this then it will give an error.
#we will provide like below:-
df1.loc[0]

A    A0
B    B0
C    C0
D    D0
Name: 0, dtype: object

In [93]:
#If I want some particular value then provide Column name dot followed by row index.
df1[['A']].loc[[0]]
#df1[['A','B']].loc[[0,1]]

    A
0  A0

In [99]:
#Now, When we can use iloc ?

##df1.iloc[:,:] => Left side showing Row Indexing, Right Side showing Column Indexing.
##df1.iloc[Row Index,Column Index]

df1.iloc[0:2,2:]

    C   D
0  C0  D0
1  C1  D1

In [103]:
df2 = pd.DataFrame({'A': ['A4','A5','A6','A7'],
                  'B': ['B4','B5','B6','B7'],
                  'C': ['C4','C5','C6','C7'],
                  'D': ['D4','D5','D6','D7']})

In [106]:
df3 = pd.DataFrame({'A': ['A8','A9','A10','A11'],
                  'B': ['B8','B9','B10','B11'],
                  'C': ['C8','C9','C10','C11'],
                  'D': ['D8','D9','D10','D11']})

In [105]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [104]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [107]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [108]:
print('\nThe DataFrame number 1\n','-'*30, sep='')
print(df1)

The DataFrame number 1
------------------------------
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [109]:
print('\nThe DataFrame number 1\n','-'*30, sep='')
print(df2)

The DataFrame number 1
------------------------------
    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [110]:
print('\nThe DataFrame number 1\n','-'*30, sep='')
print(df3)

The DataFrame number 1
------------------------------
     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [121]:
#Concatenation
df_cat1 = pd.concat([df1,df2,df3],axis=0)
print('\nThe DataFrame number 1\n','-'*30, sep='')
print(df_cat1)
df_cat1.iloc[2]
#df_cat1.iloc[1:3,2:4]

The DataFrame number 1
------------------------------
     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

A    A2
B    B2
C    C2
D    D2
Name: 2, dtype: object